spec/cassettes/Subscription/_create_payment/is_called_when_the_model_is_updated_with_first_and_second_deposits.yml

---
http_interactions:
- request:
    method: post
    uri: https://ak-test-2q80HU8DISm2atgm0iRKRVIePzDb34qYp:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - '*'
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Jul 2014 23:53:11 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMdb9a7030017a11e487d602a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.74
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTVVhWAwQDVUYdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKAgFTVlIACgZSV1UDCQdSUx0WAVBQT0ISBw1VDltVBANdAFkEUAsAUxQbQQACVEBVOQ==
      Content-Length:
      - '1291'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-01T23:53:11.419666Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-01T23:53:11.419668Z",
              "href": "/bank_accounts/BA6GRemmWJK71xgy2G6mSGBT",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA6GRemmWJK71xgy2G6mSGBT"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 01 Jul 2014 23:53:12 GMT
- request:
    method: get
    uri: https://ak-test-2q80HU8DISm2atgm0iRKRVIePzDb34qYp:@api.balancedpayments.com/bank_accounts/BA6GRemmWJK71xgy2G6mSGBT
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Jul 2014 23:53:12 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMdc57c392017a11e4a4e806429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.74
      Content-Length:
      - '499'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-01T23:53:11.419666Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-01T23:53:11.419668Z",
              "href": "/bank_accounts/BA6GRemmWJK71xgy2G6mSGBT",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA6GRemmWJK71xgy2G6mSGBT"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 01 Jul 2014 23:53:12 GMT
- request:
    method: post
    uri: https://ak-test-2q80HU8DISm2atgm0iRKRVIePzDb34qYp:@api.balancedpayments.com/bank_accounts/BA6GRemmWJK71xgy2G6mSGBT/verifications
    body:
      encoding: UTF-8
      string: '{}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Jul 2014 23:53:19 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMdc921cae017a11e4aecc02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.74
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA6GRemmWJK71xgy2G6mSGBT"
              },
              "href": "/verifications/BZ6OoLDy2XI2HY0zEViqr7GR",
              "created_at": "2014-07-01T23:53:18.122071Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-01T23:53:18.569825Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ6OoLDy2XI2HY0zEViqr7GR"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 01 Jul 2014 23:53:19 GMT
- request:
    method: get
    uri: https://ak-test-2q80HU8DISm2atgm0iRKRVIePzDb34qYp:@api.balancedpayments.com/verifications/BZ6OoLDy2XI2HY0zEViqr7GR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Jul 2014 23:53:19 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe0a772a8017a11e4ac8902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.74
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA6GRemmWJK71xgy2G6mSGBT"
              },
              "href": "/verifications/BZ6OoLDy2XI2HY0zEViqr7GR",
              "created_at": "2014-07-01T23:53:18.122071Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-01T23:53:18.569825Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ6OoLDy2XI2HY0zEViqr7GR"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 01 Jul 2014 23:53:19 GMT
- request:
    method: put
    uri: https://ak-test-2q80HU8DISm2atgm0iRKRVIePzDb34qYp:@api.balancedpayments.com/verifications/BZ6OoLDy2XI2HY0zEViqr7GR
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BA6GRemmWJK71xgy2G6mSGBT"},"created_at":"2014-07-01T23:53:18.122071Z","attempts_remaining":3,"updated_at":"2014-07-01T23:53:18.569825Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZ6OoLDy2XI2HY0zEViqr7GR","amount_1":1,"amount_2":1}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Jul 2014 23:53:19 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe0df9836017a11e4aecc02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.74
      Content-Length:
      - '601'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BA6GRemmWJK71xgy2G6mSGBT"
              },
              "href": "/verifications/BZ6OoLDy2XI2HY0zEViqr7GR",
              "created_at": "2014-07-01T23:53:18.122071Z",
              "attempts_remaining": 2,
              "updated_at": "2014-07-01T23:53:19.893930Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZ6OoLDy2XI2HY0zEViqr7GR"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 01 Jul 2014 23:53:20 GMT
- request:
    method: get
    uri: https://ak-test-2q80HU8DISm2atgm0iRKRVIePzDb34qYp:@api.balancedpayments.com/bank_accounts/BA6GRemmWJK71xgy2G6mSGBT
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Jul 2014 23:53:20 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe123a59e017a11e4b88e02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.74
      Content-Length:
      - '525'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ6OoLDy2XI2HY0zEViqr7GR"
              },
              "can_credit": true,
              "created_at": "2014-07-01T23:53:11.419666Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-01T23:53:19.891971Z",
              "href": "/bank_accounts/BA6GRemmWJK71xgy2G6mSGBT",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BA6GRemmWJK71xgy2G6mSGBT"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 01 Jul 2014 23:53:20 GMT
- request:
    method: post
    uri: https://ak-test-2q80HU8DISm2atgm0iRKRVIePzDb34qYp:@api.balancedpayments.com/bank_accounts/BA6GRemmWJK71xgy2G6mSGBT/debits
    body:
      encoding: UTF-8
      string: '{"amount":65000,"appears_on_statement_as":"Epicodus Tuition","description":"Some
        descriptive text for the debit in the dashboard"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Jul 2014 23:53:21 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe16a2938017a11e4b88e02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.74
      Content-Length:
      - '1033'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": "Some descriptive text for the debit in the dashboard",
              "links": {
                "customer": null,
                "source": "BA6GRemmWJK71xgy2G6mSGBT",
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-07-01T23:53:21.032431Z",
              "created_at": "2014-07-01T23:53:20.776550Z",
              "transaction_number": "W198-296-5754",
              "failure_reason": null,
              "currency": "USD",
              "amount": 65000,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD6RnYWrwHzWin63JFefJR7b",
              "appears_on_statement_as": "BAL*Epicodus Tuition",
              "id": "WD6RnYWrwHzWin63JFefJR7b"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.order": "/orders/{debits.order}",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.events": "/debits/{debits.id}/events"
          }
        }
    http_version: 
  recorded_at: Tue, 01 Jul 2014 23:53:22 GMT
recorded_with: VCR 2.9.2
